package main

import (
	"RIpPeakBack/internal/app/ds"
	"RIpPeakBack/internal/app/dsn"
	"github.com/joho/godotenv"
	_ "github.com/lib/pq"
	"gorm.io/driver/postgres"
	"gorm.io/gorm"
)

func main() {
	_ = godotenv.Load()
	db, err := gorm.Open(postgres.Open(dsn.FromEnv()), &gorm.Config{})
	if err != nil {
		panic("failed to connect database")
	}

	alpinists := []*ds.Alpinist{
		&ds.Alpinist{
			Name:        "Райнхольд Андреас Месснер",
			Lifetime:    "17 сентября 1944 - нн (78 лет)",
			Country:     "Италия",
			ImageRef:    "http://localhost:9000/peak/messner.png",
			BigImageRef: "http://localhost:9000/peak/messnerBig.jpg",
			Description: "Райнхольд Андреас Месснер (нем. Reinhold Andreas Messner; род. 17 сентября 1944, Бриксен) — итальянский альпинист из немецкоговорящей автономной провинции Южного Тироля, Италия, первым совершивший восхождения на все 14 «восьмитысячников» мира, некоторые из них в одиночку.</p><p> Месснер — один из самых знаменитых альпинистов в мировой истории, путешественник, писатель, в настоящее время депутат Европарламента и общественный деятель. Пионер спортивного подхода к альпинизму, ввел в практику скоростные одиночные восхождения, сначала в Доломитовых Альпах, а затем и в районе Монблана. Стал первым альпинистом, покорившим все 14 восьмитысячников мира, одним из первых достиг семи высочайших вершин континентов, двух полюсов. Совершил рекордные восхождения в разных регионах: по южной стене Аконкагуа, Брич Уолл на Килиманджаро, по юго-западной стене на Мак-Кинли и др. Но главным образом он стал известен своими восхождениями в Гималаях.</p><p>9 апреля 2010 года Райнхольду Месснеру вручён почётный Lifetime Achievement Piolet d’Or (Золотой ледоруб — самая престижная награда в альпинизме, вручаемая за выдающиеся достижения), второй в истории после Вальтера Бонатти (2009). Лауреат премии принцессы Астурийской (2018, совместно с Кшиштофом Велицким).",
			Status:      "действует",
		},
		&ds.Alpinist{
			Name:        "Юзеф Е́жи «Юрек» Куку́чка",
			Lifetime:    "24 марта 1948 - 24 октября 1989 (41 год)",
			Country:     "Польша",
			ImageRef:    "http://localhost:9000/peak/kukuczka.png",
			BigImageRef: "http://localhost:9000/peak/kukuczkaBig.jpg",
			Description: "Юзеф Е́жи «Юрек» Куку́чка (польск. Józef Jerzy Kukuczka; 24 марта 1948, Катовице, Польская Республика — 24 октября 1989, Лхоцзе, Гималаи, Непал) — польский альпинист, второй (после Райнхольда Месснера) в мире восходитель на все восьмитысячники планеты. Офицер Ордена Возрождения Польши (посмертно), золотого и серебряного Креста Заслуги, кавалер серебряного Олимпийского ордена XV зимних олимпийских игр (Калгари, 1988), одиннадцатикратный обладатель золотой медали «За выдающиеся спортивные достижения», почётный член Польской ассоциации альпинизма (PZA) (посмертно).\nДля обретения «Короны Гималаев» Ежи Кукучке понадобилось чуть меньше восьми лет (Р. Месснеру шестнадцать — на последний он поднялся 17 октября 1986 года, Кукучка менее года спустя — 18 сентября 1987-го). На десять из четырнадцати восьмитысячников планеты Ежи поднялся по новым маршрутам, на семь из них в альпийском стиле, на четыре впервые зимой. Восхождения на шесть из них были осуществлены в течение менее чем двух календарных лет.\nПогиб в результате обрыва страховочной верёвки во время попытки восхождения на Лхоцзе по Южной стене с последующим срывом на почти 2000 метров. Тело не найдено. Формально захоронено в ледниковой трещине у подножия стены.",
			Status:      "действует",
		},
		&ds.Alpinist{
			Name:        "Лоретан, Эрхард",
			Lifetime:    "28 апреля 1959 - 28 апреля 2011 (52 года)",
			Country:     "Швейцария",
			ImageRef:    "http://localhost:9000/peak/erhard.jpeg",
			BigImageRef: "http://localhost:9000/peak/erhard.jpeg",
			Description: "Эрхард Лоретан (англ. Erhard Loretan; 1959—2011) — швейцарский альпинист, горный гид, третий человек в мире, покоривший все 14 вершин планеты высотой более 8000 метров (второй после Райнхольда Месснера по бескислородным восхождениям).\nЭрхард Лоретан родился 28 апреля в Бюле — небольшой коммуне под Фрибургом, кантон Вале, Швейцария. По профессии плотник-краснодеревщик[2]. Альпинизмом начал заниматься в возрасте 11 лет и четыре года спустя покорил свою первую «серьёзную» вершину — Долденхорн[de] (3645 м) (по восточной стене)[3]. В 1981 году получил квалификацию горного гида[4].\n\nЕго первым восьмитысячником стала вершина Нанга-Парбат в Пакистане, которую он покорил в 1982 году. За последующие 13 лет Лоретан взошёл на все вершины выше 8000 метров, став третьим человеком в мире после Месснера и Ежи Кукучки, кому они оказались по силам. Среди его наиболее выдающихся достижений потрясающий хет-трик на Гашербрум II (8035), Гашербрум I (8068) и Броуд-Пик (8091), на которые он поднялся за 17 дней (1983), а также восхождение на Эверест в 1986 году, совершённое по северной стене по кулуару Хорнбайна за 43 часа без кислорода. Зимой этого же 1986 года Лоретан за 19 дней он покорил 38 вершин в Вальских Альпах, 30 из которых высотой более 4000 метров.\nВ 2003 году Лоретан был признан швейцарским судом виновным в непреднамеренном убийстве собственного семимесячного ребёнка и приговорён к четырём месяцам лишения свободы условно и штрафу. Несмотря на то, что обвинение настаивало на более суровом наказании, судья заявил, что известный альпинист «и так уже достаточно наказан тем, что своими руками, сам того не подозревая, погубил собственного сына»[6]. Причиной смерти младенца стал синдром детского сотрясения (СДС) — в канун Рождества 2001 года, Лоретан, пытаясь успокоить плачущего сына, слегка встряхнул его, что привело к трагическим последствиям. Альпинист отказался от анонимности процесса, и, по его словам, сам хотел, чтобы этот процесс привлёк внимание родителей к проблеме СДС и показал важность бережного отношения к маленьким детям. «Я должен жить с этой драмой до конца моих дней, до того момента, когда мы с ним встретимся вновь».\nЭрхард Лоретан погиб 28 апреля 2011 года в свой собственный день рождения во время восхождения вместе с его клиенткой Ксенией Миндер (англ. Xenia Minder) на вершину Грос-Грюнхорн в результате срыва и падения на более чем 200 метров. В своём интервью она рассказала, что потеряла равновесие на гребневом участке маршрута и сдёрнула Лоретана за собой. Сама она получила тяжёлые травмы.",
			Status:      "действует",
		},
	}

	db.Create(alpinists)
}
